; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	infrared1 - mode
	infrared4 - mode
	infrared3 - mode
	spectrograph0 - mode
	spectrograph2 - mode
	Star0 - direction
	Star2 - direction
	GroundStation3 - direction
	Star4 - direction
	GroundStation1 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Star11 - direction
	Planet12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Star15 - direction
	Phenomenon16 - direction
	Planet17 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 spectrograph0)
	(supports instrument0 infrared3)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 GroundStation1)
	(supports instrument1 infrared4)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon8)
)
(:goal (and
	(have_image Phenomenon5 infrared1)
	(have_image Phenomenon6 infrared1)
	(have_image Phenomenon7 infrared4)
	(have_image Phenomenon8 infrared4)
	(have_image Phenomenon9 spectrograph0)
	(have_image Phenomenon10 spectrograph2)
	(have_image Star11 infrared4)
	(have_image Planet12 infrared1)
	(have_image Phenomenon13 infrared1)
	(have_image Star14 infrared4)
	(have_image Star15 spectrograph2)
	(have_image Phenomenon16 infrared3)
	(have_image Planet17 infrared1)
))

)

; plan
1. (turn_to satellite0 groundstation1 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 groundstation1)
   goals met: 0 of 13
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 13
3. (calibrate satellite0 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 0 of 13
4. (turn_to satellite0 star14 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 star14)
   goals met: 0 of 13
5. (take_image satellite0 star14 instrument1 infrared4)
   added: (have_image star14 infrared4)
   goals met: 1 of 13
6. (turn_to satellite0 star11 star14)
   deleted: (pointing satellite0 star14)
   added: (pointing satellite0 star11)
   goals met: 1 of 13
7. (take_image satellite0 star11 instrument1 infrared4)
   added: (have_image star11 infrared4)
   goals met: 2 of 13
8. (turn_to satellite0 phenomenon8 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 phenomenon8)
   goals met: 2 of 13
9. (take_image satellite0 phenomenon8 instrument1 infrared4)
   added: (have_image phenomenon8 infrared4)
   goals met: 3 of 13
10. (turn_to satellite0 phenomenon7 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon7)
   goals met: 3 of 13
11. (take_image satellite0 phenomenon7 instrument1 infrared4)
   added: (have_image phenomenon7 infrared4)
   goals met: 4 of 13
12. (turn_to satellite0 groundstation1 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 groundstation1)
   goals met: 4 of 13
13. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 4 of 13
14. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 4 of 13
15. (calibrate satellite0 instrument0 groundstation1)
   added: (calibrated instrument0)
   goals met: 4 of 13
16. (turn_to satellite0 phenomenon10 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon10)
   goals met: 4 of 13
17. (take_image satellite0 phenomenon10 instrument0 spectrograph2)
   added: (have_image phenomenon10 spectrograph2)
   goals met: 5 of 13
18. (turn_to satellite0 phenomenon13 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon13)
   goals met: 5 of 13
19. (take_image satellite0 phenomenon13 instrument0 infrared1)
   added: (have_image phenomenon13 infrared1)
   goals met: 6 of 13
20. (turn_to satellite0 phenomenon16 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon16)
   goals met: 6 of 13
21. (take_image satellite0 phenomenon16 instrument0 infrared3)
   added: (have_image phenomenon16 infrared3)
   goals met: 7 of 13
22. (turn_to satellite0 phenomenon5 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 phenomenon5)
   goals met: 7 of 13
23. (take_image satellite0 phenomenon5 instrument0 infrared1)
   added: (have_image phenomenon5 infrared1)
   goals met: 8 of 13
24. (turn_to satellite0 phenomenon6 phenomenon5)
   deleted: (pointing satellite0 phenomenon5)
   added: (pointing satellite0 phenomenon6)
   goals met: 8 of 13
25. (take_image satellite0 phenomenon6 instrument0 infrared1)
   added: (have_image phenomenon6 infrared1)
   goals met: 9 of 13
26. (turn_to satellite0 phenomenon9 phenomenon6)
   deleted: (pointing satellite0 phenomenon6)
   added: (pointing satellite0 phenomenon9)
   goals met: 9 of 13
27. (take_image satellite0 phenomenon9 instrument0 spectrograph0)
   added: (have_image phenomenon9 spectrograph0)
   goals met: 10 of 13
28. (turn_to satellite0 planet12 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet12)
   goals met: 10 of 13
29. (take_image satellite0 planet12 instrument0 infrared1)
   added: (have_image planet12 infrared1)
   goals met: 11 of 13
30. (turn_to satellite0 planet17 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet17)
   goals met: 11 of 13
31. (take_image satellite0 planet17 instrument0 infrared1)
   added: (have_image planet17 infrared1)
   goals met: 12 of 13
32. (turn_to satellite0 star15 planet17)
   deleted: (pointing satellite0 planet17)
   added: (pointing satellite0 star15)
   goals met: 12 of 13
33. (take_image satellite0 star15 instrument0 spectrograph2)
   added: (have_image star15 spectrograph2)
   goals met: 13 of 13
